FNN_model(
  (l1): Linear(in_features=10, out_features=22, bias=True)
  (l2): Linear(in_features=22, out_features=22, bias=True)
  (l3): Linear(in_features=22, out_features=1, bias=True)
  (act_func): Softplus(beta=1, threshold=20)
  (out_act_func): Identity()
)